# pandas: Reading and Writing Data

In [1]:
import pandas as pd
import numpy as np

In [2]:
data = pd.read_csv('pdcsv1.csv')
data

   white  red  blue  green animal
0      1  5.0   2.0      3    cat
1      2  7.0   8.0      5    dog
2      3  NaN   6.0      7  horse
3      4  5.0   6.0      7   duck
4      9  NaN   NaN      6  mouse
5      9  8.0   7.0      6  mouse
6      9  8.0   7.0      6  mouse

In [4]:
data.head(3)

   white  red  blue  green animal
0      1  5.0   2.0      3    cat
1      2  7.0   8.0      5    dog
2      3  NaN   6.0      7  horse

In [6]:
data.tail(2)

   white  red  blue  green animal
5      9  8.0   7.0      6  mouse
6      9  8.0   7.0      6  mouse

In [5]:
# Checking the data type
data.dtypes

white       int64
red       float64
blue      float64
green       int64
animal     object
dtype: object

In [6]:
# Total number of rows and columns
data.shape

(7, 5)

In [7]:
# Dropping the duplicates
df = data.drop_duplicates()
#df.head(6)
df

   white  red  blue  green animal
0      1  5.0   2.0      3    cat
1      2  7.0   8.0      5    dog
2      3  NaN   6.0      7  horse
3      4  5.0   6.0      7   duck
4      9  NaN   NaN      6  mouse
5      9  8.0   7.0      6  mouse

In [8]:
df.shape

(6, 5)

In [9]:
data.shape

(7, 5)

# Dropping the missing or null values.

In [10]:
## To check if data contains null values
df.isnull().values.any()

True

In [11]:
df

   white  red  blue  green animal
0      1  5.0   2.0      3    cat
1      2  7.0   8.0      5    dog
2      3  NaN   6.0      7  horse
3      4  5.0   6.0      7   duck
4      9  NaN   NaN      6  mouse
5      9  8.0   7.0      6  mouse

In [12]:
# Finding the null values.
print(df.isnull().sum())

white     0
red       2
blue      1
green     0
animal    0
dtype: int64

In [13]:
# Dropping the missing values.
df1 = df.dropna(axis=1) 
df1

   white  green animal
0      1      3    cat
1      2      5    dog
2      3      7  horse
3      4      7   duck
4      9      6  mouse
5      9      6  mouse

In [14]:
df.dropna(how='all')

   white  red  blue  green animal
0      1  5.0   2.0      3    cat
1      2  7.0   8.0      5    dog
2      3  NaN   6.0      7  horse
3      4  5.0   6.0      7   duck
4      9  NaN   NaN      6  mouse
5      9  8.0   7.0      6  mouse

In [15]:
df1.count()

white     6
green     6
animal    6
dtype: int64

In [16]:
# After dropping the values
print(df.isnull().sum())

white     0
red       2
blue      1
green     0
animal    0
dtype: int64

In [ ]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   white   7 non-null      int64
 1   red     5 non-null      float64
 2   blue    6 non-null      float64
 3   green   7 non-null      int64
 4   animal  7 non-null      object
dtypes: float64(2), int64(2), object(1)
memory usage: 408.0+ bytes

In [ ]:
data.describe()

          white       red      blue     green
count  7.000000  5.000000  6.000000  7.000000
mean   5.285714  6.600000  6.000000  5.714286
std    3.592320  1.516575  2.097618  1.380131
min    1.000000  5.000000  2.000000  3.000000
25%    2.500000  5.000000  6.000000  5.500000
50%    4.000000  7.000000  6.500000  6.000000
75%    9.000000  8.000000  7.000000  6.500000
max    9.000000  8.000000  8.000000  7.000000

In [ ]:
data

   white  red  blue  green animal
0      1  5.0   2.0      3    cat
1      2  7.0   8.0      5    dog
2      3  NaN   6.0      7  horse
3      4  5.0   6.0      7   duck
4      9  NaN   NaN      6  mouse
5      9  8.0   7.0      6  mouse
6      9  8.0   7.0      6  mouse

In [ ]:
pd.read_csv('pdcsv3.csv')

   1  5  2  3    cat
0  2  7  8  5    dog
1  3  3  6  7  horse
2  2  2  8  3   duck
3  4  4  2  1  mouse

In [ ]:
pd.read_csv('pdcsv3.csv', header=None)

   0  1  2  3      4
0  1  5  2  3    cat
1  2  7  8  5    dog
2  3  3  6  7  horse
3  2  2  8  3   duck
4  4  4  2  1  mouse

In [ ]:
p1=pd.read_csv('pdcsv3.csv', names=['white','red','blue','green','animal'])
p1

   white  red  blue  green animal
0      1    5     2      3    cat
1      2    7     8      5    dog
2      3    3     6      7  horse
3      2    2     8      3   duck
4      4    4     2      1  mouse

In [ ]:
pd.read_csv('pdcsv1.csv')

   white  red  blue  green animal
0      1  5.0   2.0      3    cat
1      2  7.0   8.0      5    dog
2      3  NaN   6.0      7  horse
3      4  5.0   6.0      7   duck
4      9  NaN   NaN      6  mouse
5      9  8.0   7.0      6  mouse
6      9  8.0   7.0      6  mouse

In [ ]:
pdcsv_1=pd.read_csv('pdcsv1.csv', index_col=['animal','white'])
pdcsv_1

              red  blue  green
animal white
cat    1      5.0   2.0      3
dog    2      7.0   8.0      5
horse  3      NaN   6.0      7
duck   4      5.0   6.0      7
mouse  9      NaN   NaN      6
       9      8.0   7.0      6
       9      8.0   7.0      6

In [ ]:
p2=pd.read_csv('pdcsv4.csv')
p2

p2=pd.read_csv('pdcsv4.csv', index_col=['color','status'])
p2

# Using RegExp to Parse TXT Files

In [ ]:
. Single character, except newline
\d Digit
\D Non-digit character '$'
\s Whitespace character
\S Non-whitespace character
\n New line character
\t Tab character

In [7]:
T1=pd.read_table('pdtxt1.txt',sep='\s+', engine='python')
T1

   white  red  blue  green
0      1    5     2      3
1      2    7     8      5
2      3    3     6      7

In [ ]:
pd.read_table('pdtxt2.txt', sep='\D+', header=None, engine='python')

   0    1    2
0  0  123  122
1  1  124  321
2  2  125  333

In [ ]:
pd.read_table('pdtxt3.txt',sep=',',skiprows=[0,1,3,6])

   white  red  blue  green animal
0      1    5     2      3    cat
1      2    7     8      5    dog
2      3    3     6      7  horse
3      2    2     8      3   duck
4      4    4     2      1  mouse

# Reading TXT Files Into Parts

In [ ]:
pd.read_csv('pdcsv2.csv',skiprows=[2],nrows=3,header=None)

       0    1     2      3       4
0  white  red  blue  green  animal
1      1    5     2      3     cat
2      3    3     6      7   horse

# Writing Data in CSV

In [5]:
frame = pd.DataFrame(np.arange(16).reshape((4,4)),
index = ['red', 'blue', 'yellow', 'white'],
columns = ['ball', 'pen', 'pencil', 'paper'])
frame

        ball  pen  pencil  paper
red        0    1       2      3
blue       4    5       6      7
yellow     8    9      10     11
white     12   13      14     15

In [ ]:
frame.to_csv('pdcsv5.csv')

In [ ]:
frame.to_csv('pdcsv6.csv', index=False, header=False)

In [6]:
frame3 = pd.DataFrame([[6,np.nan,np.nan,6,np.nan],
[np.nan,np.nan,np.nan,np.nan,np.nan],
[np.nan,np.nan,np.nan,np.nan,np.nan],
[20,np.nan,np.nan,20.0,np.nan],
[19,np.nan,np.nan,19.0,np.nan]],
index=['blue','green','red','white','yellow'],
columns=['ball','mug','paper','pen','pencil'])
frame3

        ball  mug  paper   pen  pencil
blue     6.0  NaN    NaN   6.0     NaN
green    NaN  NaN    NaN   NaN     NaN
red      NaN  NaN    NaN   NaN     NaN
white   20.0  NaN    NaN  20.0     NaN
yellow  19.0  NaN    NaN  19.0     NaN

In [7]:
frame3.to_csv('pdcsv7.csv')

In [8]:
frame3.to_csv('pdcsv7.csv', na_rep ='NaN')

# Reading and Writing Data on Microsoft Excel Files

In [ ]:
X1=pd.read_excel('XL1.xlsx')
X1

   ID  Reg Name  Marks
0   1   11    a     80
1   2   22    b     75
2   3   33    c     90
3   4   44    d     85
4   5   55    e     69

In [ ]:
X1=pd.read_excel('XL1.xlsx','Sheet2')
X1

    1   2   3   4 Class
0  10  20  30  40     A
1  30  40  50  60     B
2  40  50  60  70     C

In [ ]:
X1=pd.read_excel('XL1.xlsx',1)
X1

    1   2   3   4 Class
0  10  20  30  40     A
1  30  40  50  60     B
2  40  50  60  70     C

In [ ]:
frame = pd.DataFrame(np.random.random((4,4)),
index = ['exp1','exp2','exp3','exp4'],
columns = ['Jan2015','Fab2015','Mar2015','Apr2005'])
frame

       Jan2015   Fab2015   Mar2015   Apr2005
exp1  0.278013  0.091623  0.429459  0.340149
exp2  0.795633  0.990592  0.219555  0.870868
exp3  0.540886  0.241323  0.418428  0.624481
exp4  0.662628  0.207609  0.738868  0.827359

In [ ]:
frame.to_excel('data2.xlsx')

# **Reading and Writing HTML Files**

** Writing Data in HTML**

In [9]:
!pip install html5lib

Requirement already satisfied: html5lib in c:\anacoda\new folder\lib\site-packages (1.1)
Requirement already satisfied: webencodings in c:\anacoda\new folder\lib\site-packages (from html5lib) (0.5.1)
Requirement already satisfied: six>=1.9 in c:\anacoda\new folder\lib\site-packages (from html5lib) (1.16.0)

In [10]:
import pandas as pd
import numpy as np

In [11]:
# Writing Data in HTML
frame = pd.DataFrame(np.arange(4).reshape(2,2))
frame

   0  1
0  0  1
1  2  3

In [12]:
 print(frame.to_html())

<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>0</th>
      <th>1</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>0</th>
      <td>0</td>
      <td>1</td>
    </tr>
    <tr>
      <th>1</th>
      <td>2</td>
      <td>3</td>
    </tr>
  </tbody>
</table>

In [13]:
frame = pd.DataFrame( np.random.random((4,4)),
index = ['white','black','red','blue'],
columns = ['up','down','right','left'])
frame

             up      down     right      left
white  0.378030  0.610004  0.251274  0.892000
black  0.381219  0.500769  0.173933  0.778466
red    0.382499  0.411209  0.925008  0.083739
blue   0.821535  0.559895  0.396397  0.752539

In [14]:
s = ['<HTML>']
s.append('<HEAD><TITLE>My DataFrame</TITLE></HEAD>')
s.append('<BODY>')
s.append(frame.to_html())
s.append('</BODY></HTML>')
html = ''.join(s)

In [15]:
print(html)

<HTML><HEAD><TITLE>My DataFrame</TITLE></HEAD><BODY><table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>up</th>
      <th>down</th>
      <th>right</th>
      <th>left</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>white</th>
      <td>0.378030</td>
      <td>0.610004</td>
      <td>0.251274</td>
      <td>0.892000</td>
    </tr>
    <tr>
      <th>black</th>
      <td>0.381219</td>
      <td>0.500769</td>
      <td>0.173933</td>
      <td>0.778466</td>
    </tr>
    <tr>
      <th>red</th>
      <td>0.382499</td>
      <td>0.411209</td>
      <td>0.925008</td>
      <td>0.083739</td>
    </tr>
    <tr>
      <th>blue</th>
      <td>0.821535</td>
      <td>0.559895</td>
      <td>0.396397</td>
      <td>0.752539</td>
    </tr>
  </tbody>
</table></BODY></HTML>

In [18]:
html_file = open('myFrame.html','w')
html_file.write(html)
html_file.close()

In [19]:
html_file.close()

**Reading Data from an HTML File**

In [13]:
frame.to_html()

'<table border="1" class="dataframe">\n  <thead>\n    <tr style="text-align: right;">\n      <th></th>\n      <th>up</th>\n      <th>down</th>\n      <th>right</th>\n      <th>left</th>\n    </tr>\n  </thead>\n  <tbody>\n    <tr>\n      <th>white</th>\n      <td>0.211553</td>\n      <td>0.511739</td>\n      <td>0.517075</td>\n      <td>0.631560</td>\n    </tr>\n    <tr>\n      <th>black</th>\n      <td>0.079092</td>\n      <td>0.650034</td>\n      <td>0.137211</td>\n      <td>0.895421</td>\n    </tr>\n    <tr>\n      <th>red</th>\n      <td>0.009511</td>\n      <td>0.093739</td>\n      <td>0.869914</td>\n      <td>0.747298</td>\n    </tr>\n    <tr>\n      <th>blue</th>\n      <td>0.907811</td>\n      <td>0.301820</td>\n      <td>0.968440</td>\n      <td>0.267606</td>\n    </tr>\n  </tbody>\n</table>'

In [14]:
 html_file = open('Frame.html','w')
 html_file.write(html)
 html_file.close()

In [15]:
web_frames = pd.read_html('Frame.html')
web_frames[0]

  Unnamed: 0        up      down     right      left
0      white  0.211553  0.511739  0.517075  0.631560
1      black  0.079092  0.650034  0.137211  0.895421
2        red  0.009511  0.093739  0.869914  0.747298
3       blue  0.907811  0.301820  0.968440  0.267606

In [17]:
ranking = pd.read_html('https://www.meccanismocomplesso.org/en/meccanismo-complesso-sito-2/classifica-punteggio/')
ranking

[     Unnamed: 0        Member  Points  Levels
 0             1   BrunoOrsini    2075     NaN
 1             2     Berserker     700     NaN
 2             3  albertosallu     275     NaN
 3             4           Jon     180     NaN
 4             5          Mr.Y     180     NaN
 ..          ...           ...     ...     ...
 110         111  Gigi Bertana       5     NaN
 111         112       p.barut       5     NaN
 112         113  Indri4Africa       5     NaN
 113         114     ghirograf       5     NaN
 114         115  Marco Corbet       5     NaN

 [115 rows x 4 columns]]

In [18]:
ranking[0]

     Unnamed: 0        Member  Points  Levels
0             1   BrunoOrsini    2075     NaN
1             2     Berserker     700     NaN
2             3  albertosallu     275     NaN
3             4           Jon     180     NaN
4             5          Mr.Y     180     NaN
..          ...           ...     ...     ...
110         111  Gigi Bertana       5     NaN
111         112       p.barut       5     NaN
112         113  Indri4Africa       5     NaN
113         114     ghirograf       5     NaN
114         115  Marco Corbet       5     NaN

[115 rows x 4 columns]

**Reading Data from XML**

In [21]:
from lxml import objectify

In [22]:
xml = objectify.parse('books.xml')
xml

In [23]:
root = xml.getroot()

In [24]:
root.Book.Author

'Ross, Mark'

In [25]:
root.Book.PublishDate

'2014-22-01'

In [26]:
#To access various elements at the same time using getchildren().
root.getchildren()

In [27]:
#With the tag attribute you get the name of the tag corresponding to the child node.
[child.tag for child in root.Book.getchildren()]

['Author', 'Title', 'Genre', 'Price', 'PublishDate']

In [28]:
#While with the text attribute you get the value contained between the corresponding tags.
[child.text for child in root.Book.getchildren()]

['Ross, Mark', 'XML Cookbook', 'Computer', '23.56', '2014-22-01']

**To convert xml directly to a dataframe**

In [27]:
xml = objectify.parse('books.xml')
root = xml.getroot()

In [44]:
root.getchildren()[1].getchildren()

['Bracket, Barbara', 'XML for Dummies', 'Computer', 35.95, '2014-12-16']

In [45]:
len(root.getchildren())

2

In [46]:
column_names = []
for i in range(0,len(root.getchildren()[0].getchildren())):
  column_names.append(root.getchildren()[0].getchildren()[i].tag)
xml_frame = pd.DataFrame(columns=column_names)
for j in range(0, len(root.getchildren())):
 obj = root.getchildren()[j].getchildren()
 texts = []
 for k in range(0, len(column_names)):
   texts.append(obj[k].text)
 row = dict(zip(column_names, texts))
 row_s = pd.Series(row)
 row_s.name = j
 xml_frame = xml_frame.append(row_s)
xml_frame

             Author            Title     Genre  Price PublishDate
0        Ross, Mark     XML Cookbook  Computer  23.56  2014-22-01
1  Bracket, Barbara  XML for Dummies  Computer  35.95  2014-12-16

**JSON Data**

In [47]:
import numpy as np
import pandas as pd

In [49]:
frame = pd.DataFrame(np.arange(16).reshape(4,4),
index=['white','black','red','blue'],
columns=['up','down','right','left'])
frame

       up  down  right  left
white   0     1      2     3
black   4     5      6     7
red     8     9     10    11
blue   12    13     14    15

In [50]:
frame.to_json('frame.json')

In [51]:
pd.read_json('frame.json')

       up  down  right  left
white   0     1      2     3
black   4     5      6     7
red     8     9     10    11
blue   12    13     14    15

In [53]:
import json
file = open('books.json','r')
text = file.read()
text = json.loads(text)

In [54]:
from pandas.io.json import json_normalize

In [55]:
json_normalize(text,'books')

C:\Users\Admin\AppData\Local\Temp/ipykernel_6864/2223923742.py:1: FutureWarning: pandas.io.json.json_normalize is deprecated, use pandas.json_normalize instead
  json_normalize(text,'books')

                 title  price
0         XML Cookbook  23.56
1  Python Fundamentals  50.70
2    The NumPy library  12.30
3      Java Enterprise  28.60
4                HTML5  31.35
5   Python for Dummies  28.00

In [56]:
 json_normalize(text,'books',['nationality','writer'])

C:\Users\Admin\AppData\Local\Temp/ipykernel_6864/3659712716.py:1: FutureWarning: pandas.io.json.json_normalize is deprecated, use pandas.json_normalize instead
  json_normalize(text,'books',['nationality','writer'])

                 title  price nationality           writer
0         XML Cookbook  23.56         USA        Mark Ross
1  Python Fundamentals  50.70         USA        Mark Ross
2    The NumPy library  12.30         USA        Mark Ross
3      Java Enterprise  28.60          UK  Barbara Bracket
4                HTML5  31.35          UK  Barbara Bracket
5   Python for Dummies  28.00          UK  Barbara Bracket

# **The Format HDF5**

In [34]:
#To import HDFStore
from pandas.io.pytables import HDFStore

**To store the data of a dataframe within an.h5 file**

In [45]:
#create a dataframe.
import numpy as np
import pandas as pd
frame = pd.DataFrame(np.arange(16).reshape(4,4),
index=['white','black','red','blue'],
columns=['up','down','right','left'])
frame

       up  down  right  left
white   0     1      2     3
black   4     5      6     7
red     8     9     10    11
blue   12    13     14    15

In [47]:
store = HDFStore('data121.h5')
store['obj1'] = frame

In [48]:
store['obj2'] = frame

In [49]:
store['obj3'] = frame

In [50]:
store

<class 'pandas.io.pytables.HDFStore'>
File path: data121.h5

In [51]:
store['obj2']

       up  down  right  left
white   0     1      2     3
black   4     5      6     7
red     8     9     10    11
blue   12    13     14    15

In [52]:
store.close

<bound method HDFStore.close of <class 'pandas.io.pytables.HDFStore'>
File path: data121.h5
>

In [53]:
from google.colab import drive
drive.mount('/content/gdrive/')
#%cd '/content/gdrive/My Drive/FDALAB/'

ModuleNotFoundError: No module named 'google'

In [54]:
%cd '/content/gdrive/My Drive/FDALAB/'

[WinError 3] The system cannot find the path specified: "'/content/gdrive/My Drive/FDALAB/'"
C:\Users\Admin

In [55]:
with pd.HDFStore('data.h5') as hdf:
    # This prints a list of all group names:
    print(hdf.keys())

[]

In [56]:
import pandas as pd
#hdf = pd.HDFStore('mydata.h5', 'r')
#df=pd.read_hdf('mydata.h5')
df=pd.read_hdf('data.h5', key='obj2',mode='r')
df

KeyError: 'No object named obj2 in the file'